CrossReferenceRawData/CCjsonVaporWrk2.txt
Running 10m test @ http://169.254.247.94:8080/json
  4 threads and 20 connections
  Thread calibration: mean lat.: 6.100ms, rate sampling interval: 27ms
  Thread calibration: mean lat.: 6.139ms, rate sampling interval: 28ms
  Thread calibration: mean lat.: 6.169ms, rate sampling interval: 28ms
  Thread calibration: mean lat.: 6.129ms, rate sampling interval: 26ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.50ms    2.81ms  15.77ms   84.39%
    Req/Sec     5.83     28.26   200.00     95.52%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.59ms
 75.000%    4.99ms
 90.000%    8.15ms
 99.000%   14.57ms
 99.900%   15.40ms
 99.990%   15.65ms
 99.999%   15.77ms
100.000%   15.77ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.971     0.000000            1         1.00
       2.151     0.100000         1180         1.11
       2.571     0.200000         2366         1.25
       2.941     0.300000         3536         1.43
       3.263     0.400000         4716         1.67
       3.587     0.500000         5895         2.00
       3.793     0.550000         6483         2.22
       4.033     0.600000         7074         2.50
       4.307     0.650000         7664         2.86
       4.631     0.700000         8253         3.33
       4.995     0.750000         8842         4.00
       5.287     0.775000         9133         4.44
       5.679     0.800000         9431         5.00
       6.135     0.825000         9722         5.71
       6.659     0.850000        10017         6.67
       7.395     0.875000        10311         8.00
       7.799     0.887500        10460         8.89
       8.155     0.900000        10606        10.00
       8.615     0.912500        10754        11.43
       9.471     0.925000        10901        13.33
      10.615     0.937500        11048        16.00
      10.999     0.943750        11123        17.78
      11.527     0.950000        11195        20.00
      12.063     0.956250        11269        22.86
      12.543     0.962500        11344        26.67
      13.103     0.968750        11416        32.00
      13.319     0.971875        11453        35.56
      13.535     0.975000        11491        40.00
      13.695     0.978125        11527        45.71
      13.927     0.981250        11564        53.33
      14.127     0.984375        11601        64.00
      14.247     0.985938        11621        71.11
      14.327     0.987500        11637        80.00
      14.463     0.989062        11656        91.43
      14.591     0.990625        11675       106.67
      14.711     0.992188        11692       128.00
      14.759     0.992969        11702       142.22
      14.831     0.993750        11711       160.00
      14.895     0.994531        11720       182.86
      14.975     0.995313        11729       213.33
      15.039     0.996094        11738       256.00
      15.087     0.996484        11744       284.44
      15.111     0.996875        11749       320.00
      15.191     0.997266        11752       365.71
      15.239     0.997656        11757       426.67
      15.271     0.998047        11761       512.00
      15.319     0.998242        11765       568.89
      15.351     0.998437        11766       640.00
      15.367     0.998633        11768       731.43
      15.391     0.998828        11771       853.33
      15.407     0.999023        11773      1024.00
      15.447     0.999121        11774      1137.78
      15.455     0.999219        11775      1280.00
      15.495     0.999316        11777      1462.86
      15.535     0.999414        11778      1706.67
      15.551     0.999512        11779      2048.00
      15.551     0.999561        11779      2275.56
      15.583     0.999609        11781      2560.00
      15.583     0.999658        11781      2925.71
      15.583     0.999707        11781      3413.33
      15.631     0.999756        11782      4096.00
      15.631     0.999780        11782      4551.11
      15.631     0.999805        11782      5120.00
      15.631     0.999829        11782      5851.43
      15.655     0.999854        11783      6826.67
      15.655     0.999878        11783      8192.00
      15.655     0.999890        11783      9102.22
      15.655     0.999902        11783     10240.00
      15.655     0.999915        11783     11702.86
      15.775     0.999927        11784     13653.33
      15.775     1.000000        11784          inf
#[Mean    =        4.497, StdDeviation   =        2.815]
#[Max     =       15.768, Total count    =        11784]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  12004 requests in 10.00m, 3.72MB read
Requests/sec:     20.01
Transfer/sec:      6.35KB