CrossReferenceRawData/CCjsonVaporWrk2_IT2.txt
Running 10m test @ http://169.254.247.94:8080/json
  4 threads and 20 connections
  Thread calibration: mean lat.: 4.031ms, rate sampling interval: 14ms
  Thread calibration: mean lat.: 3.928ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 3.831ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 4.185ms, rate sampling interval: 14ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.23ms    1.15ms  10.01ms   73.28%
    Req/Sec     5.84     32.21   333.00     96.30%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.00ms
 75.000%    3.82ms
 90.000%    4.69ms
 99.000%    7.14ms
 99.900%    9.20ms
 99.990%    9.97ms
 99.999%   10.02ms
100.000%   10.02ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.029     0.000000            1         1.00
       1.995     0.100000         1180         1.11
       2.291     0.200000         2360         1.25
       2.539     0.300000         3541         1.43
       2.761     0.400000         4716         1.67
       3.003     0.500000         5896         2.00
       3.143     0.550000         6485         2.22
       3.279     0.600000         7071         2.50
       3.445     0.650000         7663         2.86
       3.629     0.700000         8257         3.33
       3.819     0.750000         8838         4.00
       3.917     0.775000         9141         4.44
       4.039     0.800000         9430         5.00
       4.171     0.825000         9725         5.71
       4.319     0.850000        10020         6.67
       4.475     0.875000        10317         8.00
       4.579     0.887500        10461         8.89
       4.691     0.900000        10611        10.00
       4.815     0.912500        10753        11.43
       4.983     0.925000        10907        13.33
       5.115     0.937500        11049        16.00
       5.211     0.943750        11123        17.78
       5.283     0.950000        11197        20.00
       5.411     0.956250        11271        22.86
       5.571     0.962500        11343        26.67
       5.755     0.968750        11416        32.00
       5.867     0.971875        11454        35.56
       6.051     0.975000        11491        40.00
       6.199     0.978125        11528        45.71
       6.387     0.981250        11564        53.33
       6.603     0.984375        11600        64.00
       6.715     0.985938        11619        71.11
       6.855     0.987500        11637        80.00
       7.059     0.989062        11656        91.43
       7.163     0.990625        11674       106.67
       7.295     0.992188        11692       128.00
       7.407     0.992969        11702       142.22
       7.523     0.993750        11711       160.00
       7.687     0.994531        11720       182.86
       7.767     0.995313        11729       213.33
       8.019     0.996094        11738       256.00
       8.155     0.996484        11743       284.44
       8.287     0.996875        11748       320.00
       8.471     0.997266        11752       365.71
       8.647     0.997656        11757       426.67
       8.791     0.998047        11761       512.00
       8.935     0.998242        11764       568.89
       8.991     0.998437        11766       640.00
       9.047     0.998633        11768       731.43
       9.167     0.998828        11771       853.33
       9.223     0.999023        11773      1024.00
       9.295     0.999121        11774      1137.78
       9.343     0.999219        11775      1280.00
       9.375     0.999316        11776      1462.86
       9.463     0.999414        11778      1706.67
       9.495     0.999512        11779      2048.00
       9.495     0.999561        11779      2275.56
       9.503     0.999609        11780      2560.00
       9.503     0.999658        11780      2925.71
       9.599     0.999707        11781      3413.33
       9.719     0.999756        11782      4096.00
       9.719     0.999780        11782      4551.11
       9.719     0.999805        11782      5120.00
       9.719     0.999829        11782      5851.43
       9.967     0.999854        11783      6826.67
       9.967     0.999878        11783      8192.00
       9.967     0.999890        11783      9102.22
       9.967     0.999902        11783     10240.00
       9.967     0.999915        11783     11702.86
      10.015     0.999927        11784     13653.33
      10.015     1.000000        11784          inf
#[Mean    =        3.225, StdDeviation   =        1.146]
#[Max     =       10.008, Total count    =        11784]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  12004 requests in 10.00m, 3.72MB read
Requests/sec:     20.01
Transfer/sec:      6.35KB